
public class ChordKind {
	
	static String ckk= null;
;
	static boolean ischord = false;


	public  ChordKind(){
		
	}
	
	public static String Ischord(int a, int b, int c, int d) {
//		boolean ischord = false;
		boolean r5 = false;//
		String ck = null;

		boolean r51 = false;

		// ///////////////////////cant
		int chordnum = 0;
//		String ck = "";
		// /////////////////////1
		if ((a % 7 == 1) || (a % 7 == 3) || (a % 7 == 5)) {
			if ((b % 7 == 1) && (c % 7 == 3) && (d % 7 == 5)) {
				chordnum = 10135;
				r51 = true;
			}
			if ((b % 7 == 1) && (d % 7 == 3) && (c % 7 == 5)
					&& (a % 7 == 1 || a % 7 == 5)) {
				chordnum = 10153;
				r51 = true;
				r5 = true;
				ck = "一级六和弦";
			}
			if ((c % 7 == 1) && (b % 7 == 3) && (d % 7 == 5)) {
				chordnum = 10315;
				r51 = true;
			}
			if ((c % 7 == 1) && (d % 7 == 3) && (b % 7 == 5)
					&& (a % 7 == 1 || a % 7 == 5)) {
				chordnum = 10513;
				r51 = true;
				r5 = true;
				ck = "一级六和弦";
			}
			if ((d % 7 == 1) && (b % 7 == 3) && (c % 7 == 5) && a % 7 == 1) {
				chordnum = 10351;
				r51 = true;
				r5 = true;
				ck = "一级正三和弦";
			}
			if ((d % 7 == 1) && (c % 7 == 3) && (b % 7 == 5) && a % 7 == 1) {
				chordnum = 10531;
				r51 = true;
				r5 = true;
				ck = "一级正三和弦";
			}
			// ///////////////a=t1
			// if ((cant[ii+3] % 7 == 1) && (cant[ii+2] % 7 == 3)
			// && (b % 7 == 3)&&a% 7 == 5) {
			// chordnum = 10531;r51 = true;
			// r5=true;
			// }
			if ((d % 7 == 1) && (c % 7 == 5) && (b % 7 == 5) && a % 7 == 3) {
				chordnum = 10531;
				r51 = true;
				// r5=true;ck="一级正三和弦重复5音";
			}
			// ///////////////a=t3
			if ((d % 7 == 3) && (c % 7 == 5) && (b % 7 == 5) && a % 7 == 1) {
				chordnum = 10531;
				r51 = true;
				r5 = true;
				ck = "一级六和弦重复5音 A=T 根音旋律位置";
			}
			if ((d % 7 == 3) && (c % 7 == 1) && (b % 7 == 1) && a % 7 == 5) {
				chordnum = 10531;
				r51 = true;
				r5 = true;
				ck = "一级六和弦重复根音 A=T 五音旋律位置";
			}
			// //////////////a=b1
			if ((d % 7 == 1) && (c % 7 == 3) && (b % 7 == 1) && a % 7 == 5) {
				chordnum = 10531;
				r51 = true;
				r5 = true;
				ck = "一级正三和弦重复根音 A=B 五音旋律位置";
			}
			if ((d % 7 == 1) && (c % 7 == 5) && (b % 7 == 1) && a % 7 == 3) {
				chordnum = 10531;
				r51 = true;
				r5 = true;
				ck = "一级正三和弦重复根音 A=B 三音旋律位置";
			}
			// //////////////a=b5
			if ((d % 7 == 5) && (c % 7 == 1) && (b % 7 == 5) && a % 7 == 3) {
				chordnum = 10531;
				r51 = true;
				// r5=true;ck="一级四六和弦 重复五音 A=B 三音旋律位置";
			}
			if ((d % 7 == 5) && (c % 7 == 3) && (b % 7 == 5) && a % 7 == 1) {
				chordnum = 10531;
				r51 = true;
				// r5=true;ck="一级四六和弦 重复五音 A=B 根音旋律位置";
			}
			// //////////////t=b1
			if ((d % 7 == 1) && (c % 7 == 1) && (b % 7 == 3) && a % 7 == 5) {
				chordnum = 10531;
				r51 = true;
				r5 = true;
				ck = "一级正三和弦重复根音 T=B 五音旋律位置";
			}
			if ((d % 7 == 1) && (c % 7 == 1) && (b % 7 == 5) && a % 7 == 3) {
				chordnum = 10531;
				r51 = true;
				r5 = true;
				ck = "一级正三和弦重复根音 T=B 三音旋律位置";
			}
			// //////////////t=b5
			if ((d % 7 == 5) && (c % 7 == 5) && (b % 7 == 1) && a % 7 == 3) {
				chordnum = 10531;
				r51 = true;
				// r5=true;ck="一级四六和弦 重复五音 T=B 三音旋律位置";
			}
			if ((d % 7 == 5) && (c % 7 == 5) && (b % 7 == 3) && a % 7 == 1) {
				chordnum = 10531;
				r51 = true;
				// r5=true;ck="一级四六和弦 重复五音 T=B 根音旋律位置";
			}
		}

		// //////////////////2
		if ((a % 7 == 2) || (a % 7 == 4) || (a % 7 == 6)) {
			if ((b % 7 == 2) && (c % 7 == 4) && (d % 7 == 6)) {
				chordnum = 20246;
				r51 = true;
			}
			if ((b % 7 == 2) && (d % 7 == 4) && (c % 7 == 6)) {
				chordnum = 20264;
				r51 = true;
				r5 = true;
				ck = "二级六和弦";
			}

			if ((c % 7 == 2) && (b % 7 == 4) && (d % 7 == 6)) {
				chordnum = 20426;
				r51 = true;
			}
			if ((c % 7 == 2) && (d % 7 == 4) && (b % 7 == 6)) {
				chordnum = 20624;
				r51 = true;
				r5 = true;
				ck = "二级六和弦";
			}

			if ((d % 7 == 2) && (b % 7 == 4) && (c % 7 == 6)) {
				chordnum = 20462;
				r51 = true;
				r5 = true;
				ck = "二级原位和弦";
			}
			if ((d % 7 == 2) && (c % 7 == 4) && (b % 7 == 6)) {
				chordnum = 20642;
				r51 = true;
				r5 = true;
				ck = "二级原位和弦";
			}
			// ///////////////a=t2 4
			if ((d % 7 == 2) && (c % 7 == 4) && (b % 7 == 4) && a % 7 == 6) {
				chordnum = 10422;
				r51 = true;
				r5 = true;
				ck = "二级原位和弦 重复三音A=T 五音旋律位置";
			}
			// if ((cant[ii+3] % 7 == 4) && (cant[ii+2] % 7 == 6)
			// && (b % 7 == 6)&&a% 7==2) {
			// chordnum = 10466;r51 = true;
			// r5=true;
			// }

			// //////////////a=t4 2
			if ((d % 7 == 4) && (c % 7 == 2) && (b % 7 == 2) && a % 7 == 6) {
				chordnum = 10422;
				r51 = true;
				r5 = true;
				ck = "二级六和弦 重复根音A=T 五音旋律位置";
			}

			// /////////////// a=b4
			if ((d % 7 == 4) && (c % 7 == 2) && (b % 7 == 4) && a % 7 == 6) {
				chordnum = 10531;
				r51 = true;
				r5 = true;
				ck = "二级六和弦 重复三音A=B 五音旋律位置";
			}
			if ((d % 7 == 4) && (c % 7 == 6) && (b % 7 == 4) && a % 7 == 2) {
				chordnum = 10531;
				r51 = true;
				r5 = true;
				ck = "二级六和弦 重复三音A=B 根音旋律位置";
			}
			// /////////////// a=b2
			if ((d % 7 == 2) && (c % 7 == 4) && (b % 7 == 2) && a % 7 == 6) {
				chordnum = 10531;
				r51 = true;
				r5 = true;
				ck = "二级原位和弦 重复根音A=B 五音旋律位置";
			}
			if ((d % 7 == 2) && (c % 7 == 6) && (b % 7 == 2) && a % 7 == 4) {
				chordnum = 10531;
				r51 = true;
				r5 = true;
				ck = "二级原位和弦 重复根音A=B 三音旋律位置";
			}
			// //////////////t=b4
			if ((d % 7 == 4) && (c % 7 == 4) && (b % 7 == 2) && a % 7 == 6) {
				chordnum = 10531;
				r51 = true;
				r5 = true;
				ck = "二级六和弦 重复三音T=B 五音旋律位置";
			}
			if ((d % 7 == 4) && (c % 7 == 4) && (b % 7 == 6) && a % 7 == 2) {
				chordnum = 10531;
				r51 = true;
				r5 = true;
				ck = "二级六和弦 重复三音T=B 根音旋律位置";
			}
			// //////////////t=b2
			if ((d % 7 == 2) && (c % 7 == 2) && (b % 7 == 4) && a % 7 == 6) {
				chordnum = 10531;
				r51 = true;
				r5 = true;
				ck = "二级原位和弦 重复根音T=B 五音旋律位置";
			}
			if ((d % 7 == 4) && (c % 7 == 4) && (b % 7 == 2) && a % 7 == 4) {
				chordnum = 10531;
				r51 = true;
				r5 = true;
				ck = "二级原位和弦 重复根音T=B 三音旋律位置";
			}
		}

		// /////////////////////////////3
		if ((a % 7 == 3) || (a % 7 == 5) || (a % 7 == 0)) {
			if ((b % 7 == 3) && (c % 7 == 5) && (d % 7 == 0)) {
				chordnum = 20246;
				r51 = true;
			}
			if ((b % 7 == 3) && (d % 7 == 5) && (c % 7 == 0)) {
				chordnum = 20264;
				r51 = true;
				r5 = true;
				ck = "三级六和弦";
			}

			if ((c % 7 == 3) && (b % 7 == 5) && (d % 7 == 0)) {
				chordnum = 20426;
				r51 = true;
			}
			if ((c % 7 == 3) && (d % 7 == 5) && (b % 7 == 0)) {
				chordnum = 20624;
				r51 = true;
				r5 = true;
				ck = "三级六和弦";
			}

			if ((d % 7 == 3) && (b % 7 == 5) && (c % 7 == 0)) {
				chordnum = 20462;
				r51 = true;
				r5 = true;
				ck = "三级原位和弦";
			}
			if ((d % 7 == 3) && (c % 7 == 5) && (b % 7 == 0)) {
				chordnum = 20642;
				r51 = true;
				r5 = true;
				ck = "三级原位和弦";
			}
			// ///////////////a=t2 4
			if ((d % 7 == 3) && (c % 7 == 5) && (b % 7 == 5) && a % 7 == 0) {
				chordnum = 10422;
				r51 = true;
				r5 = true;
				ck = "三级原位和弦 重复三音A=T 五音旋律位置";
			}
			// if ((cant[ii+3] % 7 == 5) && (cant[ii+2] % 7 == 0)
			// && (b % 7 == 0)&&a% 7==2) {
			// chordnum = 10466;r51 = true;
			// r5=true;
			// }

			// //////////////a=t4 2
			if ((d % 7 == 5) && (c % 7 == 3) && (b % 7 == 3) && a % 7 == 0) {
				chordnum = 10422;
				r51 = true;
				r5 = true;
				ck = "三级六和弦 重复根音A=T 五音旋律位置";
			}

			// /////////////// a=b4
			if ((d % 7 == 5) && (c % 7 == 3) && (b % 7 == 5) && a % 7 == 0) {
				chordnum = 10531;
				r51 = true;
				r5 = true;
				ck = "三级六和弦 重复三音A=B 五音旋律位置";
			}
			if ((d % 7 == 5) && (c % 7 == 0) && (b % 7 == 5) && a % 7 == 3) {
				chordnum = 10531;
				r51 = true;
				r5 = true;
				ck = "三级六和弦 重复三音A=B 根音旋律位置";
			}
			// /////////////// a=b2
			if ((d % 7 == 3) && (c % 7 == 5) && (b % 7 == 3) && a % 7 == 0) {
				chordnum = 10531;
				r51 = true;
				r5 = true;
				ck = "三级原位和弦 重复根音A=B 五音旋律位置";
			}
			if ((d % 7 == 3) && (c % 7 == 0) && (b % 7 == 3) && a % 7 == 5) {
				chordnum = 10531;
				r51 = true;
				r5 = true;
				ck = "三级原位和弦 重复根音A=B 三音旋律位置";
			}
			// //////////////t=b4
			if ((d % 7 == 5) && (c % 7 == 5) && (b % 7 == 3) && a % 7 == 0) {
				chordnum = 10531;
				r51 = true;
				r5 = true;
				ck = "三级六和弦 重复三音T=B 五音旋律位置";
			}
			if ((d % 7 == 5) && (c % 7 == 5) && (b % 7 == 0) && a % 7 == 3) {
				chordnum = 10531;
				r51 = true;
				r5 = true;
				ck = "三级六和弦 重复三音T=B 根音旋律位置";
			}
			// //////////////t=b2
			if ((d % 7 == 3) && (c % 7 == 3) && (b % 7 == 5) && a % 7 == 0) {
				chordnum = 10531;
				r51 = true;
				r5 = true;
				ck = "三级原位和弦 重复根音T=B 五音旋律位置";
			}
			if ((d % 7 == 5) && (c % 7 == 5) && (b % 7 == 3) && a % 7 == 5) {
				chordnum = 10531;
				r51 = true;
				r5 = true;
				ck = "三级原位和弦 重复根音T=B 三音旋律位置";
			}
		}

		// /////////////////4
		if ((a % 7 == 4) || (a % 7 == 6) || (a % 7 == 1)) {
			if ((b % 7 == 4) && (c % 7 == 6) && (d % 7 == 1)) {
				chordnum = 10135;
				r51 = true;
			}
			if ((b % 7 == 4) && (d % 7 == 6) && (c % 7 == 1)
					&& (a % 7 == 4 || a % 7 == 1)) {
				chordnum = 10153;
				r51 = true;
				r5 = true;
				ck = "四级六和弦";
			}
			if ((c % 7 == 4) && (b % 7 == 6) && (d % 7 == 1)) {
				chordnum = 10315;
				r51 = true;
			}
			if ((c % 7 == 4) && (d % 7 == 6) && (b % 7 == 1)
					&& (a % 7 == 4 || a % 7 == 1)) {
				chordnum = 10513;
				r51 = true;
				r5 = true;
				ck = "四级六和弦";
			}
			if ((d % 7 == 4) && (b % 7 == 6) && (c % 7 == 1) && a % 7 == 4) {
				chordnum = 10351;
				r51 = true;
				r5 = true;
				ck = "四级正三和弦";
			}
			if ((d % 7 == 4) && (c % 7 == 6) && (b % 7 == 1) && a % 7 == 4) {
				chordnum = 10531;
				r51 = true;
				r5 = true;
				ck = "四级正三和弦";
			}
			// ///////////////a=t1
			// if ((cant[ii+3] % 7 == 4) && (cant[ii+2] % 7 == 6)
			// && (b % 7 == 6)&&a% 7 == 1) {
			// chordnum = 10531;r51 = true;
			// r5=true;
			// }
			if ((d % 7 == 4) && (c % 7 == 1) && (b % 7 == 1) && a % 7 == 6) {
				chordnum = 10531;
				r51 = true;
				// r5=true;ck="四级正三和弦重复5音";
			}
			// ///////////////a=t3
			if ((d % 7 == 6) && (c % 7 == 1) && (b % 7 == 1) && a % 7 == 4) {
				chordnum = 10531;
				r51 = true;
				r5 = true;
				ck = "四级六和弦重复5音 A=T 根音旋律位置";
			}
			if ((d % 7 == 6) && (c % 7 == 4) && (b % 7 == 4) && a % 7 == 1) {
				chordnum = 10531;
				r51 = true;
				r5 = true;
				ck = "四级六和弦重复根音 A=T 五音旋律位置";
			}
			// //////////////a=b1
			if ((d % 7 == 4) && (c % 7 == 6) && (b % 7 == 4) && a % 7 == 1) {
				chordnum = 10531;
				r51 = true;
				r5 = true;
				ck = "四级正三和弦重复根音 A=B 五音旋律位置";
			}
			if ((d % 7 == 4) && (c % 7 == 1) && (b % 7 == 4) && a % 7 == 6) {
				chordnum = 10531;
				r51 = true;
				r5 = true;
				ck = "四级正三和弦重复根音 A=B 三音旋律位置";
			}
			// //////////////a=b5
			if ((d % 7 == 1) && (c % 7 == 4) && (b % 7 == 1) && a % 7 == 6) {
				chordnum = 10531;
				r51 = true;
				// r5=true;ck="四级四六和弦 重复五音 A=B 三音旋律位置";
			}
			if ((d % 7 == 1) && (c % 7 == 6) && (b % 7 == 1) && a % 7 == 4) {
				chordnum = 10531;
				r51 = true;
				// r5=true;ck="四级四六和弦 重复五音 A=B 根音旋律位置";
			}
			// //////////////t=b1
			if ((d % 7 == 4) && (c % 7 == 4) && (b % 7 == 6) && a % 7 == 1) {
				chordnum = 10531;
				r51 = true;
				r5 = true;
				ck = "四级正三和弦重复根音 T=B 五音旋律位置";
			}
			if ((d % 7 == 4) && (c % 7 == 4) && (b % 7 == 1) && a % 7 == 6) {
				chordnum = 10531;
				r51 = true;
				r5 = true;
				ck = "四级正三和弦重复根音 T=B 三音旋律位置";
			}
			// //////////////t=b5
			if ((d % 7 == 1) && (c % 7 == 1) && (b % 7 == 4) && a % 7 == 6) {
				chordnum = 10531;
				r51 = true;
				// r5=true;ck="四级四六和弦 重复五音 T=B 三音旋律位置";
			}
			if ((d % 7 == 1) && (c % 7 == 1) && (b % 7 == 6) && a % 7 == 4) {
				chordnum = 10531;
				r51 = true;
				// r5=true;ck="四级四六和弦 重复五音 T=B 根音旋律位置";
			}
		}

		// ////////////////////////5
		if ((a % 7 == 5) || (a % 7 == 0) || (a % 7 == 2)) {
			if ((b % 7 == 5) && (c % 7 == 0) && (d % 7 == 2)) {
				chordnum = 10135;
				r51 = true;
			}
			if ((b % 7 == 5) && (d % 7 == 0) && (c % 7 == 2)
					&& (a % 7 == 5 || a % 7 == 2)) {
				chordnum = 10153;
				r51 = true;
				r5 = true;
				ck = "五级六和弦";
			}
			if ((c % 7 == 5) && (b % 7 == 0) && (d % 7 == 2)) {
				chordnum = 10315;
				r51 = true;
			}
			if ((c % 7 == 5) && (d % 7 == 0) && (b % 7 == 2)
					&& (a % 7 == 5 || a % 7 == 2)) {
				chordnum = 10513;
				r51 = true;
				r5 = true;
				ck = "五级六和弦";
			}
			if ((d % 7 == 5) && (b % 7 == 0) && (c % 7 == 2) && a % 7 == 5) {
				chordnum = 10351;
				r51 = true;
				r5 = true;
				ck = "五级正三和弦";
			}
			if ((d % 7 == 5) && (c % 7 == 0) && (b % 7 == 2) && a % 7 == 5) {
				chordnum = 10531;
				r51 = true;
				r5 = true;
				ck = "五级正三和弦";
			}
			// ///////////////a=t1
			// if ((cant[ii+3] % 7 == 5) && (cant[ii+2] % 7 == 0)
			// && (b % 7 == 0)&&a% 7 == 2) {
			// chordnum = 10531;r51 = true;
			// r5=true;
			// }
			if ((d % 7 == 5) && (c % 7 == 2) && (b % 7 == 2) && a % 7 == 0) {
				chordnum = 10531;
				r51 = true;
				// r5=true;ck="五级正三和弦重复5音";
			}
			// ///////////////a=t3
			if ((d % 7 == 0) && (c % 7 == 2) && (b % 7 == 2) && a % 7 == 5) {
				chordnum = 10531;
				r51 = true;
				r5 = true;
				ck = "五级六和弦重复5音 A=T 根音旋律位置";
			}
			if ((d % 7 == 0) && (c % 7 == 5) && (b % 7 == 5) && a % 7 == 2) {
				chordnum = 10531;
				r51 = true;
				r5 = true;
				ck = "五级六和弦重复根音 A=T 五音旋律位置";
			}
			// //////////////a=b1
			if ((d % 7 == 5) && (c % 7 == 0) && (b % 7 == 5) && a % 7 == 2) {
				chordnum = 10531;
				r51 = true;
				r5 = true;
				ck = "五级正三和弦重复根音 A=B 五音旋律位置";
			}
			if ((d % 7 == 5) && (c % 7 == 2) && (b % 7 == 5) && a % 7 == 0) {
				chordnum = 10531;
				r51 = true;
				r5 = true;
				ck = "五级正三和弦重复根音 A=B 三音旋律位置";
			}
			// //////////////a=b5
			if ((d % 7 == 2) && (c % 7 == 5) && (b % 7 == 2) && a % 7 == 0) {
				chordnum = 10531;
				r51 = true;
				// r5=true;ck="五级四六和弦 重复五音 A=B 三音旋律位置";
			}
			if ((d % 7 == 2) && (c % 7 == 0) && (b % 7 == 2) && a % 7 == 5) {
				chordnum = 10531;
				r51 = true;
				// r5=true;ck="五级四六和弦 重复五音 A=B 根音旋律位置";
			}
			// //////////////t=b1
			if ((d % 7 == 5) && (c % 7 == 5) && (b % 7 == 0) && a % 7 == 2) {
				chordnum = 10531;
				r51 = true;
				r5 = true;
				ck = "五级正三和弦重复根音 T=B 五音旋律位置";
			}
			if ((d % 7 == 5) && (c % 7 == 5) && (b % 7 == 2) && a % 7 == 0) {
				chordnum = 10531;
				r51 = true;
				r5 = true;
				ck = "五级正三和弦重复根音 T=B 三音旋律位置";
			}
			// //////////////t=b5
			if ((d % 7 == 2) && (c % 7 == 2) && (b % 7 == 5) && a % 7 == 0) {
				chordnum = 10531;
				r51 = true;
				// r5=true;ck="五级四六和弦 重复五音 T=B 三音旋律位置";
			}
			if ((d % 7 == 2) && (c % 7 == 2) && (b % 7 == 0) && a % 7 == 5) {
				chordnum = 10531;
				r51 = true;
				// r5=true;ck="五级四六和弦 重复五音 T=B 根音旋律位置";
			}
		}

		// /////////////////6
		if ((a % 7 == 6) || (a % 7 == 1) || (a % 7 == 3)) {
			if ((b % 7 == 6) && (c % 7 == 1) && (d % 7 == 3)) {
				chordnum = 60613;
				r51 = true;
			}
			if ((b % 7 == 6) && (d % 7 == 1) && (c % 7 == 3)) {
				chordnum = 60631;
				r51 = true;

			}
			if ((c % 7 == 6) && (b % 7 == 1) && (d % 7 == 3)) {
				chordnum = 70274;
				r51 = true;
			}
			if ((c % 7 == 6) && (d % 7 == 1) && (b % 7 == 3)) {
				chordnum = 60361;
				r51 = true;

			}
			if ((d % 7 == 6) && (b % 7 == 1) && (c % 7 == 3)
					&& (a % 7 == 6 || a % 7 == 1)) {
				chordnum = 70247;
				r51 = true;
				r5 = true;
				ck = "六级原位三和弦";
			}
			if ((d % 7 == 6) && (c % 7 == 1) && (b % 7 == 3)
					&& (a % 7 == 6 || a % 7 == 1)) {
				chordnum = 70427;
				r51 = true;
				r5 = true;
				ck = "六级原位三和弦";
			}
			// ///////////////a=t
			if ((d % 7 == 6) && (c % 7 == 3) && (b % 7 == 3) && a % 7 == 1) {
				chordnum = 10422;
				r51 = true;
				r5 = true;
				ck = "六级原位三和弦 A=T 重复五音 根音旋律";
			}
			// if ((cant[ii+3] % 7 == 1) && (cant[ii+2] % 7 == 6)
			// && (b % 7 == 6)&&a% 7==3) {
			// chordnum = 10466;r51 = true;
			// r5=true;
			// }
			// //////////////a=b
			if ((d % 7 == 6) && (c % 7 == 3) && (b % 7 == 6) && a % 7 == 1) {
				chordnum = 10531;
				r51 = true;
				r5 = true;
				ck = "六级原位三和弦 A=B 重复根音 三音旋律";
			}
			if ((d % 7 == 6) && (c % 7 == 1) && (b % 7 == 6) && a % 7 == 3) {
				chordnum = 10531;
				r51 = true;
				r5 = true;
				ck = "六级原位三和弦 A=B 重复根音 五音旋律";
			}
			// //////////////t=b
			if ((d % 7 == 6) && (c % 7 == 6) && (b % 7 == 3) && a % 7 == 1) {
				chordnum = 10531;
				r51 = true;
				r5 = true;
				ck = "六级原位三和弦 T=B 重复根音 三音旋律";
			}
			if ((d % 7 == 6) && (c % 7 == 6) && (b % 7 == 1) && a % 7 == 3) {
				chordnum = 10531;
				r51 = true;
				r5 = true;
				ck = "六级原位三和弦 T=B 重复根音 五音旋律";
			}
		}

		// /////////////////7
		if ((a % 7 == 0) || (a % 7 == 2) || (a % 7 == 4)) {
			if ((b % 7 == 0) && (c % 7 == 2) && (d % 7 == 4)) {
				chordnum = 70724;
				r51 = true;
			}
			if ((b % 7 == 0) && (d % 7 == 2) && (c % 7 == 4)) {
				chordnum = 70742;
				r51 = true;
				r5 = true;
				ck = "七级六和弦";
			}
			if ((c % 7 == 0) && (b % 7 == 2) && (d % 7 == 4)) {
				chordnum = 70274;
				r51 = true;
			}
			if ((c % 7 == 0) && (d % 7 == 2) && (b % 7 == 4)) {
				chordnum = 70472;
				r51 = true;
				r5 = true;
				ck = "七级六和弦";
			}
			if ((d % 7 == 0) && (b % 7 == 2) && (c % 7 == 4)) {
				chordnum = 70247;
				r51 = true;
			}
			if ((d % 7 == 0) && (c % 7 == 2) && (b % 7 == 4)) {
				chordnum = 70427;
				r51 = true;
			}
			// ///////////////a=t
			if ((d % 7 == 2) && (c % 7 == 4) && (b % 7 == 4) && a % 7 == 0) {
				chordnum = 10422;
				r51 = true;
				r5 = true;
				ck = "七级六和弦 重复五音A=T 根音旋律 ";
			}
			if ((d % 7 == 2) && (c % 7 == 0) && (b % 7 == 0) && a % 7 == 4) {
				chordnum = 10466;
				r51 = true;
				r5 = true;
				ck = "七级六和弦 重复根音A=T 五音旋律 ";
			}
			// //////////////a=b
			if ((d % 7 == 2) && (c % 7 == 0) && (b % 7 == 2) && a % 7 == 4) {
				chordnum = 10531;
				r51 = true;
				r5 = true;
				ck = "七级六和弦 重复五音A=B 五音旋律 ";
			}
			if ((d % 7 == 2) && (c % 7 == 4) && (b % 7 == 2) && a % 7 == 0) {
				chordnum = 10531;
				r51 = true;
				r5 = true;
				ck = "七级六和弦 重复五音A=B 根音旋律 ";
			}
			// //////////////t=b
			if ((d % 7 == 2) && (c % 7 == 2) && (b % 7 == 0) && a % 7 == 4) {
				chordnum = 10531;
				r51 = true;
				r5 = true;
				ck = "七级六和弦 重复五音T=B 五音旋律 ";
			}
			if ((d % 7 == 2) && (c % 7 == 2) && (b % 7 == 4) && a % 7 == 0) {
				chordnum = 10531;
				r51 = true;
				r5 = true;
				ck = "七级六和弦 重复五音T=B 根音旋律 ";
			}
		}
		if (r5) {
			ischord = true;
		}
		
		ckk=ck;
		
		return ck;

	}
	
	
	
}
